"""
临床结局部分
    绘制Top10因子的特征重要性
"""



from pylab import *
mpl.rcParams['font.sans-serif'] = ['Arial']
plt.figure(figsize=(8, 7))


"""
LassoCV 
['血_RBC分布宽度CV','血_血红蛋白','血_单核细胞(%)','血_国际标准化比值','血_白蛋白','血_超敏C反应蛋白',
'血_中性粒细胞(#)','血_血小板计数','血_尿素','血_乳酸脱氢酶']       
['RDW_CV','HGB','Mono$\%$','INR','ALB','hs-CRP','Neu$\#$','PLT','Urea','LDH'] 
[0.008784,0.009244,0.009713,0.013211,0.035898,0.039033,0.040133,0.043158,0.049056,0.075518]


ElasticNetCV
['血_血红蛋白','血_白细胞计数','血_单核细胞(%)','血_国际标准化比值','血_中性粒细胞(#)',
'血_白蛋白','血_超敏C反应蛋白','血_血小板计数','血_尿素','血_乳酸脱氢酶'] 
['HGB','WBC','Mono$\%$','INR','Neu$\#$','ALB','hs-CRP','PLT','Urea','LDH']
[0.010167,0.010948,0.011933,0.013508,0.033914,0.035478,0.038972,0.043146,0.048589,0.074427]


RandomForest:
['血_钠','血_血小板计数','血_超敏C反应蛋白','血_淋巴细胞(#)','血_单核细胞(%)',
'血_中性粒细胞(#)','血_尿素','血_乳酸脱氢酶','血_淋巴细胞(%)','血_中性粒细胞(%)']  
['Na','PLT','hs-CRP','LYMPH$\#$','Mono$\%$','Neu$\#$','Urea','LDH','LYMPH$\%$','Neu$\%$']
[0.024726,0.025015,0.028967,0.030933,0.033617,0.036035,0.039301,0.058244,0.064346,0.078024]


"""
x = ['Na','PLT','hs-CRP','LYMPH$\#$','Mono$\%$','Neu$\#$','Urea','LDH','LYMPH$\%$','Neu$\%$']
y = [0.024726,0.025015,0.028967,0.030933,0.033617,0.036035,0.039301,0.058244,0.064346,0.078024]


plt.bar(x=x, height=y, width=0.5)
# rotation=45
plt.xticks(fontsize=14, rotation=330)  # x轴上的标签旋转45度
plt.yticks(fontsize=15)
plt.ylabel("Relative importance", fontsize=12)
plt.show()